InformationRegisters/ОтветственныеЗаОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЗаОперации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаВидовОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыВидовОпераций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеЗаОперации/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустой()
		И Параметры.ЗначениеКопирования.Пустой()
		И НЕ (Параметры.ЗначенияЗаполнения.Свойство("Организация") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Организация)) Тогда
		
		Запись.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	КонецЕсли;	
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма, "Запись", "ИсходныйКлючЗаписи", Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;
	
	ГруппаОперацииОтчетностиЦБ = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ГруппаВидовОпераций, "Родитель") = ПредопределенноеЗначение("Справочник.ГруппыВидовОпераций.ОтчетностьЦБ"));
	
	Элементы.Основной.Видимость = НЕ ГруппаОперацииОтчетностиЦБ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Элементы.Основной.Видимость Тогда
		Запись.Основной = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
